---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseExtensionMethod
source: html/ea0dfb53-044a-ed45-dd61-1e7cab2c76af.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseExtensionMethod Property

"Base Extension Method"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelBaseExtensionMethod { get; }
```